#+title: Object Detection Under Adverse Weather Condition

This repository contains the source code for the FogGuard project, a novel fog-aware object detection network developed to address the challenges posed by foggy weather conditions. Autonomous driving systems heavily rely on accurate object detection algorithms, but adverse weather conditions can significantly affect the reliability of deep neural networks (DNNs).

*** Data config
To create a YOLO-v3 compatible =image_directories=

#+begin_src sh :results output
cd ~/data/VOC
mkdir config
cd train/VOCdevkit/VOC2007/images/ && find . -name '*.jpg'  -printf $PWD/"%f\n" > ../../../../config/2007_train.txt
cd ~/data/VOC/train/VOCdevkit/VOC2012/images/ && find . -name '*.jpg'  -printf $PWD/"%f\n" > ../../../../config/2012_train.txt
cd ~/data/VOC/test/VOCdevkit/VOC2007/images/ && find . -name '*.jpg'  -printf $PWD/"%f\n" > ../../../../config/2007_test.txt
#+end_src

We can also use python to do the same thing.
#+begin_src python :results output
# create Ultralytics specific text file of training images
file = open("train_images_roboflow.txt", "w") 
for root, dirs, files in os.walk("."):
    for filename in files:
      # print("../train/images/" + filename)
      if filename == "train_images_roboflow.txt":
        pass
      else:
        file.write("../train/images/" + filename + "\n")
file.close()
#+end_src

Alternatively, we can use =data_prep/annotaiton.py= to convert the annotation from
=.xml= to =.txt= files and create a list of images directories.

For VOC, we need to work on three different directories, =train/VOC2007=,
=train/VOC2012=, and =test/VOC2007=.
#+begin_src sh :results output :dir /ssh:lab:/home/soheil/gpu/adverse_weather/fog_guard/data_prep
python annotation.py --labels_root=/home/soheil/data/VOC/train/VOCdevkit/VOC2012/ --annot_file=/home/soheil/data/VOC/config/voc2012_train.txt

python annotation.py --labels_root=/home/soheil/data/VOC/train/VOCdevkit/VOC2007/ --annot_file=/home/soheil/data/VOC/config/voc2007_train.txt

python annotation.py --labels_root=/home/soheil/data/VOC/test/VOCdevkit/VOC2007/ --annot_file=/home/soheil/data/VOC/config/voc2007_test.txt --data_type=test

#+end_src

#+RESULTS:
: Classes:  ['bicycle', 'bus', 'car', 'motorbike', 'person']
: Number of images:  11540
: Classes:  ['bicycle', 'bus', 'car', 'motorbike', 'person']
: Number of images:  5011
: Classes:  ['bicycle', 'bus', 'car', 'motorbike', 'person']
: Number of images:  4952

When these image directories are created, we need to combine the two separate
files corresponding to two VOC2007 and VOC2012 training sets.
#+begin_src sh :results output :dir /ssh:lab:/home/soheil/data/VOC/config
cat voc2007_train.txt > trainval.txt
cat voc2012_train.txt >> trainval.txt
cat voc2007_test.txt > test.txt
#+end_src

#+RESULTS:

In order to have a complete set of data config file, we need to find the address
of the set of names of classes included in our dataset. This file looks like
this for 5 classes that are included RTTS. 

#+begin_src conf
bicycle
bus
car
motorbike
person
#+end_src

and the config file name =voc-5.data= is created as follows:
#+begin_src conf
classes=5
train=/home/gharatappeh/data/VOC/config/trainval.txt
test=/home/gharatappeh/data/VOC/config/test.txt
valid=/home/gharatappeh/data/VOC/config/valid.txt
names=/home/gharatappeh/data/VOC/voc-5.names
backup=backup/
eval=voc
#+end_src

[[https://github.com/JPM-Tech/Object-Detection/blob/main/Scripts/converters/convert-yolo-to-xml.py][Link to a format converter]]

* Train FogGuard

#+begin_src sh :dir /ssh:lab:/home/soheil/gpu/adverse_weather/fog_guard :results output
sbatch hpc/lab.slurm src/teacher-student.py --data=config/voc-5.data --model=config/yolov3-rtts.cfg -e 300 -fte 300 --t_pretrained_weights=weights/yolov3.weights --s_pretrained_weights=weights/yolov3.weights
#+end_src

#+RESULTS:
: Submitted batch job 40

